# ImporterIFC Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ImporterIFC Methods
ImporterIFC Class See Also
---
The ImporterIFC type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOptions | Gets the collection of named options set by the importer client. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
| ProcessIFCProject(IFCAnyHandle, IDictionary<(Of <<'(IFCAnyHandle, ElementId>)>>)) |
| SetFile | Sets the handle to the IFC file being created during this import operation. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace